const LocalCode: number[] = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16];

const LocalData = [
    {
        name: "서울특별시",
        value: ['강남구', '강동구', '강북구', '강서구', '관악구', '광진구', '구로구', '금천구', '노원구', '도봉구', '동대문구', '동작구', '마포구', '서대문구', '서초구', '성동구', '성북구', '송파구', '양천구', '영등포구', '용산구', '은평구', '종로구', '중구', '중랑구'],
    },
    {
        name: "부산광역시",
        value: ['강서구', '금정구', '기장군', '남구', '동구', '동래구', '부산진구', '북구', '사상구', '사하구', '서구', '수영구', '연제구', '영도구', '중구', '해운대구'],
    },
    {
        name: "대구광역시",
        value: ["동구", "서구", "남구", "북구", "달서구", "수성구", "중구", "달성군"],
    },
    {
        name: "인천광역시",
        value: ['강화군', '계양구', '남동구', '동구', '미추홀구', '부평구', '서구', '연수구', '옹진군', '중구'],
    },
    {
        name: "대전광역시",
        value: ["대덕구", "동구", "서구", "유성구", "중구"],
    },
    {
        name: "울산광역시",
        value: ["동구", "중구", "남구", "북구", "울주군"],
    },
    {
        name: "광주광역시",
        value: ["동구", "서구", "남구", "북구", "광산구"],
    },
    {
        name: "세종특별자치시",
        value: ["세종시 전체"],
    },
    {
        name: "경기도",
        value: ['가평군', '고양시', '과천시', '광명시', '광주시', '구리시', '군포시', '김포시', '남양주시', '동두천시', '부천시', '성남시', '수원시', '시흥시', '안산시', '안성시', '안양시', '양주시', '양평군', '여주시', '연천군', '오산시', '용인시', '의왕시', '의정부시', '이천시', '파주시', '평택시', '포천시', '하남시', '화성시'],
    },
    {
        name: "강원도",
        value: ["강릉시", "원주시", "춘천시", "동해시", "삼척시", "속초시", "태백시", "고성군", "양구군", "양양군", "영월군", "인제군", "정선군", "철원군", "평창군", "홍천군", "화천군", "횡성군"],
    },
    {
        name: "충청남도",
        value: ["계룡시", "공주시", "금산군", "논산시", "당진시", "보령시", "부여군", "서산시", "서천군", "아산시", "예산군", "천안시", "청양군", "태안군", "홍성군"],
    },
    {
        name: "충청북도",
        value: ["괴산군", "단양군", "보은군", "영동군", "옥천군", "음성군", "제천군", "증평군", "진천군", "청주시", "충주시"],
    },
    {
        name: "경상남도",
        value: ["거제시", "거창군", "고성군", "김해시", "남해군", "밀양시", "사천시", "산청군", "양산시", "의령군", "진주시", "창녕군", "창원시", "통영시", "하동군", "함안군", "함양군", "합천군"],
    },
    {
        name: "경상북도",
        value: ["경산시", "경주시", "고령군", "구미시", "군위군", "김천시", "문경시", "봉화군", "상주시", "성주군", "안동시", "영덕군", "영양군", "영주시", "영천시", "예천군", "울릉군", "울진군", "의성군", "청도군", "청송군", "칠곡군", "포항시"],
    },
    {
        name: "전라남도",
        value: ["강진군", "고흥군", "곡성군", "광양군", "구례군", "나주시", "담양군", "목표시", "무안군", "보성군", "순천시", "신안군", "여수시", "영광군", "영암군", "완도군", "장성군", "장흥군", "진도군", "함평군", "해남군", "화순군"],
    },
    {
        name: "전라북도",
        value: ["고창군", "군산시", "김제시", "남원시", "무주군", "부안군", "순창군", "완주군", "익산시", "임실군", "장수군", "전주시", "정읍시", "진안군"],
    },
    {
        name: "제주특별자치도",
        value: ["제주시", "서귀포시"],
    }
];

const IncomeData: string[] = [
    "0~50%", "50~75%", "76~100%", "101~200%", "200%이상"
]

const PersonalData: string[] = [
    "초등학생", "중학생", "고등학생", "대학(원)생", "근로자/직장인", "구직자/실업자", "국가유공자", "보훈대상자", "독립유공자", "참전유공자", "특수임무유공자", "5·18민주유공자", "제대군인", "농업인", "축산업인", "어업인", "임업인", "예비부모/난임", "임신부", "출산/입양", "심한 장애", "심하지 않은 장애", "질병/부상/질환자", "중증·난치·희귀질환자", "요양환자/치매환자", "신혼부부", "이민자", "반려동물", "주택", "시설보호아동", "범죄피해자", "성매매피해자", "현역군인", "해당사항없음"
]

const FamilyData: string[] = [
    "1인가구", "다자녀가구", "확대가족", "한부모가정/조손가정", "다문화가족", "위탁가정", "북한이탈주민", "무주택세대", "신규전입", "위탁가정", "소년소녀가장", "해당사항없음"
]

export { LocalCode, LocalData, IncomeData, PersonalData, FamilyData};